# Capstone 3 
## Data Wrangling

First we import

In [1]:
import pandas as pd
import numpy as np

Load Dataset

In [2]:
downloaded_dataset='../data/external/Online Retail.xlsx'
df=pd.read_excel(downloaded_dataset)

Examine the data

In [3]:
df.sample(7)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
279101,561236,23300,GARDENERS KNEELING PAD CUP OF TEA,24,2011-07-26 10:27:00,1.65,15159.0,United Kingdom
427023,573373,21975,PACK OF 60 DINOSAUR CAKE CASES,2,2011-10-30 13:37:00,0.55,14684.0,United Kingdom
160510,550459,17091A,LAVENDER INCENSE IN TIN,2,2011-04-18 13:17:00,0.38,18116.0,United Kingdom
485933,577695,37489D,PINK/GREEN FLOWER DESIGN BIG MUG,4,2011-11-21 11:55:00,0.39,15645.0,United Kingdom
356312,568049,22602,RETROSPOT WOODEN HEART DECORATION,8,2011-09-23 12:38:00,0.85,17841.0,United Kingdom
317805,564818,21802,CHRISTMAS TREE HEART DECORATION,4,2011-08-30 12:10:00,0.42,NaN,United Kingdom
531819,C580971,22313,OFFICE MUG WARMER PINK,-250,2011-12-06 15:04:00,2.55,14298.0,United Kingdom

I like to use sample instead of head() to give me a random sample

In [7]:
df['Total']=df.Quantity*df.UnitPrice

In [8]:
df.shape

(541909, 9)

Not too many features but lots of values

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 9 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  datetime64[ns]
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
 8   Total        541909 non-null  float64
dtypes: datetime64[ns](1), float64(3), int64(1), object(4)
memory usage: 37.2+ MB

The types look ok at the moment, it is strange that CustomerID is a float instead of an object

Let's look for duplicates

In [10]:
df.duplicated().sum()

5268

In [11]:
df = df[~df.duplicated()]
df.shape

(536641, 9)

Let's look for missing values

In [12]:
df.isnull().sum()*100/len(df)

InvoiceNo       0.000000
StockCode       0.000000
Description     0.270945
Quantity        0.000000
InvoiceDate     0.000000
UnitPrice       0.000000
CustomerID     25.163377
Country         0.000000
Total           0.000000
dtype: float64

Looks like we are missing 25% of the CustomerID

In [13]:
df['CustomerID'].fillna(00000, inplace=True)

In [14]:
df.isnull().sum()

InvoiceNo         0
StockCode         0
Description    1454
Quantity          0
InvoiceDate       0
UnitPrice         0
CustomerID        0
Country           0
Total             0
dtype: int64

In [15]:
df.describe()

            Quantity      UnitPrice     CustomerID          Total
count  536641.000000  536641.000000  536641.000000  536641.000000
mean        9.620029       4.632656   11435.904653      18.123861
std       219.130156      97.233118    6795.044250     380.656263
min    -80995.000000  -11062.060000       0.000000 -168469.600000
25%         1.000000       1.250000       0.000000       3.750000
50%         3.000000       2.080000   14336.000000       9.870000
75%        10.000000       4.130000   16241.000000      17.400000
max     80995.000000   38970.000000   18287.000000  168469.600000

negative minimum? why are there negative quantities and prices? maybe returns?

In [16]:
df=df[df['Quantity']>0]

In [17]:
df.describe()

            Quantity      UnitPrice     CustomerID          Total
count  526054.000000  526054.000000  526054.000000  526054.000000
mean       10.730874       3.871747   11413.244024      20.188016
std       157.591838      42.016560    6812.689104     272.250300
min         1.000000  -11062.060000       0.000000  -11062.060000
25%         1.000000       1.250000       0.000000       3.900000
50%         4.000000       2.080000   14334.000000       9.920000
75%        11.000000       4.130000   16242.000000      17.700000
max     80995.000000   13541.330000   18287.000000  168469.600000

In [18]:
df=df[df['UnitPrice']>0]

In [19]:
df.describe()

            Quantity      UnitPrice     CustomerID          Total
count  524878.000000  524878.000000  524878.000000  524878.000000
mean       10.616600       3.922573   11437.732164      20.275399
std       156.280031      36.093028    6799.513627     271.693566
min         1.000000       0.001000       0.000000       0.001000
25%         1.000000       1.250000       0.000000       3.900000
50%         4.000000       2.080000   14350.000000       9.920000
75%        11.000000       4.130000   16245.000000      17.700000
max     80995.000000   13541.330000   18287.000000  168469.600000

In [20]:
df["CustomerID"] = df["CustomerID"].astype(int)

Excellent, now we have a cleaned up dataset without missing values and no negative numbers. 
Let's now export it to work on further.

In [21]:
df.to_csv('../data/clean/Online Retail.csv',index=False)